In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_excel('./tsp_(중구, 24, 17-21).xlsx', sheet_name='k=4')
df

  cluster  number                                     tsp route  distance
0       A       5                              1, 4, 5, 3, 2, 1  4.416592
1       B       5                              1, 3, 2, 5, 4, 1  2.447813
2       C      13  1, 4, 2, 11, 10, 13, 7, 5, 9, 8, 6, 12, 3, 1  3.904267
3       D      12      1, 5, 4, 3, 7, 8, 10, 12, 11, 9, 2, 6, 1  3.865328

In [3]:
#n : cluster 내 대여소 갯수
for i in range(len(df)):
    n=df.iloc[i, 1]
    d=df.iloc[i, 3]
    if n>=10:
        비용1=(d/6.8)*1332.74 + 23013.75*4 + 51450000/(16.8*365*2)
        df.loc[i,'truck type']='2.5t'
        df.loc[i, 'cost']=비용1
    else: 
        비용2=(d/8.5)*1332.74 + 23013.75*4 + 18375000/(16.8*365*2)
        df.loc[i,'truck type']='1.0t'
        df.loc[i, 'cost']=비용2
df

,cluster,number,tsp route,distance,truck type,cost
0,A,5,"1, 4, 5, 3, 2, 1",4.416592,1.0t,94245.778129
1,B,5,"1, 3, 2, 5, 4, 1",2.447813,1.0t,93937.087537
2,C,13,"1, 4, 2, 11, 10, 13, 7, 5, 9, 8, 6, 12, 3, 1",3.904267,2.5t,97015.407453
3,D,12,"1, 5, 4, 3, 7, 8, 10, 12, 11, 9, 2, 6, 1",3.865328,2.5t,97007.775683

In [4]:
#total distance
a=0
for i in range(len(df)):
    a+=df.loc[i, 'distance']
a

14.634001042110999

In [5]:
#total cost
b=0
for i in range(len(df)):
    b+=df.loc[i, 'cost']
b

382206.04880124325